# Hospital Database Practices
This notebook contains SQL practices from the Hospital Database. This database has 4 tables, namely patients, admissions, doctors, and province_names. I obtained all the practice questions and this database from https://www.sql-practice.com/. But, when I looked for this database resource, it didn't exist in the community, so I did web scraping to retrieve this database. I also extracted the database into the SQL query in the form of PostgreSQL. Therefore, I also run this query on my local PostgreSQL engine, which means that some queries may not work on the sql-practice website.

You can access this SQL query and web scraping script below to try the same thing as me!

PostgreSQL query ---> [hospital.sql](https://github.com/rezamuzhaffar/data-analytics-portfolio/blob/main/SQL/hospital-sql-practice/hospital.sql)

Web scraping script ---> [hospital_db_scrap.py](https://github.com/rezamuzhaffar/data-analytics-portfolio/blob/main/SQL/hospital_db_scrap.py)

<img align ="middle" width="1000" height="700" src="https://raw.githubusercontent.com/rezamuzhaffar/data-analytics-portfolio/main/images/hospital_pgerd.png">

In [1]:
import psycopg2
from sqlalchemy import create_engine

In [2]:
conn = psycopg2.connect(
    host = 'localhost',
    port = 5432,
    user = 'postgres',
    password = '11111111',
    dbname = 'hospital'
)

In [3]:
cursor = conn.cursor()

# dialect+driver://user:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:11111111@localhost/hospital')

In [4]:
%load_ext sql

In [5]:
%sql postgresql+psycopg2://postgres:11111111@localhost/hospital

In [6]:
%%sql
--Show all of the patients grouped into weight groups.
--Show the total amount of patients in each weight group.
--Order the list by the weight group decending.
--For example, if they weight 100 to 109 they are placed in the 100 weight group, 110-119 = 110 weight group, etc. (HARD)

SELECT
    COUNT(*) AS total_patients,
    ROUND(weight / 10, 0) * 10 AS weight_group
FROM patients
GROUP BY weight_group
ORDER BY weight_group DESC

 * postgresql+psycopg2://postgres:***@localhost/hospital
15 rows affected.

[(18, Decimal('140')),
 (113, Decimal('130')),
 (323, Decimal('120')),
 (474, Decimal('110')),
 (468, Decimal('100')),
 (426, Decimal('90')),
 (539, Decimal('80')),
 (705, Decimal('70')),
 (583, Decimal('60')),
 (310, Decimal('50')),
 (142, Decimal('40')),
 (147, Decimal('30')),
 (124, Decimal('20')),
 (141, Decimal('10')),
 (17, Decimal('0'))]

In [7]:
%%sql
--Show patient_id, weight, height, isObese from the patients table. Display isObese as a boolean 0 or 1.
--Obese is defined as weight(kg)/(height(m)^2) >= 30.
--weight is in units kg.
--height is in units cm. (HARD)

SELECT patient_id, weight, height,
	CASE
        WHEN (weight)/((height*height)/10000.0) >= 30 THEN 1
        ELSE 0
    END AS isObese
FROM patients
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[(2, Decimal('76'), Decimal('185'), 0),
 (3, Decimal('106'), Decimal('194'), 0),
 (5, Decimal('10'), Decimal('47'), 1),
 (6, Decimal('5'), Decimal('43'), 0),
 (9, Decimal('95'), Decimal('173'), 1),
 (13, Decimal('77'), Decimal('146'), 1),
 (14, Decimal('95'), Decimal('220'), 0),
 (16, Decimal('59'), Decimal('153'), 0),
 (17, Decimal('114'), Decimal('179'), 1),
 (23, Decimal('75'), Decimal('154'), 1)]

In [8]:
%%sql
--Show patient_id, first_name, last_name, and attending doctor's specialty.
--Show only the patients who has a diagnosis as 'Epilepsy' and the doctor's first name is 'Lisa'
--Check patients, admissions, and doctors tables for required information. (HARD)

SELECT p.patient_id, p.first_name, p.last_name, specialty
FROM patients p
JOIN admissions a
	ON p.patient_id = a.patient_id
JOIN doctors d
	ON a.attending_doctor_id = d.doctor_id
WHERE diagnosis = 'Epilepsy' AND d.first_name = 'Lisa'

 * postgresql+psycopg2://postgres:***@localhost/hospital
2 rows affected.

[(468, 'Frank', 'Anderson', 'Obstetrician/Gynecologist'),
 (701, 'Precious', 'Ashton', 'Obstetrician/Gynecologist')]

In [9]:
%%sql
/*
All patients who have gone through admissions, can see their medical documents on our site. Those patients are given a temporary password after their first admission. Show the patient_id and temp_password.
The password must be the following, in order:
1. patient_id
2. the numerical length of patient's last_name
3. year of patient's birth_date (HARD)
*/

SELECT
    DISTINCT p.patient_id,
    CONCAT(p.patient_id, LENGTH(last_name), DATE_PART('year', birth_date)) AS temp_password
FROM patients p
INNER JOIN admissions a
    ON p.patient_id = a.patient_id
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[(1048, '104881991'),
 (2962, '296251980'),
 (1825, '182552011'),
 (3055, '305571953'),
 (2034, '203451982'),
 (3914, '3914122014'),
 (4230, '423072000'),
 (3599, '359971934'),
 (1632, '1632112001'),
 (1119, '111971958')]

In [10]:
%%sql
--Each admission costs $50 for patients without insurance, and $10 for patients with insurance. All patients with an even patient_id have insurance.
--Give each patient a 'Yes' if they have insurance, and a 'No' if they don't have insurance. Add up the admission_total cost for each has_insurance group. (HARD)

SELECT has_insurance, sum(admission_cost) AS admission_total
FROM
(
  SELECT
  	CASE WHEN patient_id % 2 = 0 THEN 'Yes'
    ELSE 'No'
    END AS has_insurance,
    CASE WHEN patient_id % 2 = 0 THEN 10
    ELSE 50
    END AS admission_cost
  FROM admissions
) AS sourceTabel
GROUP BY has_insurance

 * postgresql+psycopg2://postgres:***@localhost/hospital
2 rows affected.

[('Yes', 25110), ('No', 127800)]

In [11]:
%%sql
--Show the provinces that has more patients identified as 'M' than 'F'. Must only show full province_name (HARD)

WITH
maleTable AS
	(SELECT province_id, COUNT(*) AS count_male
   FROM patients
   WHERE gender = 'M'
   GROUP BY province_id),
femaleTable AS
	(SELECT province_id, COUNT(*) AS count_female
   FROM patients
   WHERE gender = 'F'
   GROUP BY province_id)
SELECT DISTINCT province_name
FROM maleTable
JOIN femaleTable
	ON maleTable.province_id = femaleTable.province_id
JOIN province_names
	ON maleTable.province_id = province_names.province_id
WHERE count_male > count_female

 * postgresql+psycopg2://postgres:***@localhost/hospital
7 rows affected.

[('Alberta',),
 ('British Columbia',),
 ('Manitoba',),
 ('Newfoundland and Labrador',),
 ('Nova Scotia',),
 ('Ontario',),
 ('Saskatchewan',)]

In [12]:
%%sql
/*
We are looking for a specific patient. Pull all columns for the patient who matches the following criteria:
- First_name contains an 'r' after the first two letters.
- Identifies their gender as 'F'
- Born in February, May, or December
- Their weight would be between 60kg and 80kg
- Their patient_id is an odd number
- They are from the city 'Kingston' (HARD)
*/

SELECT *
FROM patients
WHERE
    first_name LIKE '__r%'
    AND gender  = 'F'
    AND DATE_PART('month', birth_date) IN (2, 5, 12)
    AND weight between 60 AND 80
    AND patient_id % 2 = 1
    AND city = 'Kingston'

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(1839, 'Chris', 'Cardenas', 'F', datetime.date(1969, 12, 2), 'Kingston', 'ON', None, Decimal('141'), Decimal('71'))]

In [13]:
%%sql
--Show the percent of patients that have 'M' as their gender. Round the answer to the nearest hundreth number and in percent form. (HARD)

SELECT
    CONCAT(
    ROUND(
      (COUNT(CASE WHEN gender = 'M' THEN 1 END) / (COUNT(*)+.0)) * 100, 2
    ),
    '%'
  ) AS male_percentage
FROM patients

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[('54.48%',)]

In [14]:
%%sql
--Sort the province names in ascending order in such a way that the province 'Ontario' is always on top. (HARD)

SELECT province_name
FROM province_names
ORDER BY
    (CASE WHEN province_name = 'Ontario' THEN 1 ELSE 2 END),
    province_name

 * postgresql+psycopg2://postgres:***@localhost/hospital
13 rows affected.

[('Ontario',),
 ('Alberta',),
 ('British Columbia',),
 ('Manitoba',),
 ('New Brunswick',),
 ('Newfoundland and Labrador',),
 ('Northwest Territories',),
 ('Nova Scotia',),
 ('Nunavut',),
 ('Prince Edward Island',),
 ('Quebec',),
 ('Saskatchewan',),
 ('Yukon',)]

In [15]:
%%sql
--We need a breakdown for the total amount of admissions each doctor has started each year. Show the doctor_id, doctor_full_name, specialty, year, total_admissions for that year. (HARD)

SELECT
    doctor_id,
    CONCAT(first_name, ' ', last_name) AS doctor_full_name,
    specialty,
    DATE_PART('year', admission_date)::INTEGER AS selected_year,
    COUNT(*) total_admissions
FROM admissions a
JOIN doctors d
    ON a.attending_doctor_id = d.doctor_id
GROUP BY doctor_id, selected_year

 * postgresql+psycopg2://postgres:***@localhost/hospital
54 rows affected.

[(12, 'Flora Moore', 'Cardiovascular Surgeon', 2018, 115),
 (9, 'Jon Nelson', 'Neurologist', 2019, 85),
 (10, 'Monica Singleton', 'Orthopaedic Surgeon', 2019, 89),
 (13, 'Angelica Noe', 'Nuclear Medicine', 2019, 92),
 (27, 'Donna Greenwood', 'Respirologist', 2018, 114),
 (20, 'Ralph Wilson', 'General Surgeon', 2019, 67),
 (9, 'Jon Nelson', 'Neurologist', 2018, 96),
 (24, 'Jenny Pulaski', 'Neurologist', 2019, 66),
 (26, 'Larry Miller', 'Cardiovascular Surgeon', 2019, 79),
 (13, 'Angelica Noe', 'Nuclear Medicine', 2018, 117),
 (21, 'Lisa Cuddy', 'Obstetrician/Gynecologist', 2019, 67),
 (12, 'Flora Moore', 'Cardiovascular Surgeon', 2019, 79),
 (15, 'Marie Brinkman', 'Urologist', 2018, 118),
 (7, 'Hazel Patterson', 'Oncologist', 2018, 111),
 (5, 'Scott Hill', 'Gastroenterologist', 2019, 74),
 (10, 'Monica Singleton', 'Orthopaedic Surgeon', 2018, 102),
 (15, 'Marie Brinkman', 'Urologist', 2019, 80),
 (17, 'Mary Walker', 'Nuclear Medicine', 2018, 119),
 (20, 'Ralph Wilson', 'General Surgeon', 2018, 107),
 (7, 'Hazel Patterson', 'Oncologist', 2019, 95),
 (3, 'Miriam Tregre', 'General Surgeon', 2018, 111),
 (23, 'Heather Beck', 'Pediatrician', 2018, 92),
 (26, 'Larry Miller', 'Cardiovascular Surgeon', 2018, 121),
 (6, 'Tasha Phillips', 'Psychiatrist', 2019, 80),
 (16, 'Irene Brooks', 'Gastroenterologist', 2019, 72),
 (22, 'Simon Santiago', 'Cardiologist', 2019, 82),
 (25, 'Jeanette Sites', 'Psychiatrist', 2018, 105),
 (24, 'Jenny Pulaski', 'Neurologist', 2018, 96),
 (25, 'Jeanette Sites', 'Psychiatrist', 2019, 75),
 (22, 'Simon Santiago', 'Cardiologist', 2018, 108),
 (1, 'Claude Walls', 'Internist', 2018, 105),
 (4, 'James Russo', 'Obstetrician/Gynecologist', 2019, 81),
 (18, 'Bobbi Estrada', 'Gerontologist', 2018, 96),
 (27, 'Donna Greenwood', 'Respirologist', 2019, 89),
 (3, 'Miriam Tregre', 'General Surgeon', 2019, 57),
 (17, 'Mary Walker', 'Nuclear Medicine', 2019, 72),
 (19, 'Stephanie Cohen', 'Oncologist', 2019, 77),
 (11, 'Douglas Brooks', 'Respirologist', 2019, 84),
 (14, 'Tyrone Smart', 'Gerontologist', 2019, 71),
 (8, 'Mickey Duval', 'Pediatrician', 2018, 102),
 (18, 'Bobbi Estrada', 'Gerontologist', 2019, 80),
 (5, 'Scott Hill', 'Gastroenterologist', 2018, 105),
 (16, 'Irene Brooks', 'Gastroenterologist', 2018, 117),
 (2, 'Joshua Green', 'Cardiologist', 2018, 104),
 (11, 'Douglas Brooks', 'Respirologist', 2018, 117),
 (8, 'Mickey Duval', 'Pediatrician', 2019, 81),
 (14, 'Tyrone Smart', 'Gerontologist', 2018, 111),
 (6, 'Tasha Phillips', 'Psychiatrist', 2018, 88),
 (2, 'Joshua Green', 'Cardiologist', 2019, 83),
 (1, 'Claude Walls', 'Internist', 2019, 109),
 (21, 'Lisa Cuddy', 'Obstetrician/Gynecologist', 2018, 117),
 (19, 'Stephanie Cohen', 'Oncologist', 2018, 105),
 (4, 'James Russo', 'Obstetrician/Gynecologist', 2018, 116),
 (23, 'Heather Beck', 'Pediatrician', 2019, 86)]

In [16]:
%%sql
--Show unique birth years from patients and order them by ascending. (MEDIUM)

SELECT DISTINCT(DATE_PART('year', birth_date)::INTEGER) AS unique_birth_year
FROM patients
ORDER by unique_birth_year ASC
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[(1918,),
 (1923,),
 (1925,),
 (1926,),
 (1927,),
 (1928,),
 (1929,),
 (1931,),
 (1933,),
 (1934,)]

In [17]:
%%sql
--Show unique first names from the patients table which only occurs once in the list.
--For example, if two or more people are named 'John' in the first_name column then don't include their name in the output list. If only 1 person is named 'Leo' then include them in the output. (MEDIUM)

SELECT first_name
FROM patients
GROUP BY first_name
HAVING COUNT(first_name) = 1
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Abby',),
 ('Hermione',),
 ('Isabel',),
 ('Leander',),
 ('Apolline',),
 ('Sylvester',),
 ('Hillary',),
 ('Logan',),
 ('Buford',),
 ('Marcelino',)]

In [18]:
%%sql
--Show patient_id and first_name from patients where their first_name start and ends with 's' and is at least 6 characters long. (MEDIUM)

SELECT patient_id, first_name
FROM patients
WHERE first_name LIKE 'S%s' AND LENGTH(first_name) >= 6

 * postgresql+psycopg2://postgres:***@localhost/hospital
11 rows affected.

[(496, 'Spiros'),
 (1273, 'Stanislaus'),
 (1789, 'Seamus'),
 (2258, 'Spiros'),
 (2378, 'Stanislaus'),
 (3487, 'Stanislaus'),
 (629, 'Spiros'),
 (648, 'Stanislaus'),
 (1926, 'Stanislaus'),
 (1996, 'Stanislaus'),
 (2771, 'Stanislaus')]

In [19]:
%%sql
--Show patient_id, first_name, last_name from patients whos diagnosis is 'Dementia'.
--Primary diagnosis is stored in the admissions table. (MEDIUM)

SELECT p.patient_id, first_name, last_name
FROM patients p
JOIN admissions a
  ON p.patient_id = a.patient_id
WHERE diagnosis = 'Dementia'

 * postgresql+psycopg2://postgres:***@localhost/hospital
26 rows affected.

[(160, 'Miranda', 'Delacour'),
 (178, 'David', 'Bustamonte'),
 (207, 'Matt', 'Celine'),
 (613, 'Jaki', 'Granger'),
 (836, 'Montana', 'Vimes'),
 (924, 'Simon', 'Spellman'),
 (1201, 'Irene', 'Murphy'),
 (1264, 'Jillian', 'Valentine'),
 (1402, 'Kathryn', 'Hallow'),
 (1491, 'Doris', 'McGrew'),
 (1585, 'Alex', 'Cantropus'),
 (1749, 'Alejandro', 'Mellie'),
 (1798, 'Sister', 'Trenton'),
 (1844, 'Jadu', 'Wilson'),
 (1938, 'Anthony', 'Anneke'),
 (2292, 'Jessica', 'Talbot'),
 (2532, 'Lynn', 'Willing'),
 (2689, 'Kurt', 'Jones'),
 (2834, 'Juliet', 'Harkness'),
 (3375, 'Agnes', 'Barkley'),
 (3496, 'Harry', 'Lucas'),
 (3555, 'Jack', 'Caspar'),
 (3842, 'Claudia', 'Drew'),
 (4256, 'Rita', 'Wolfe'),
 (4357, 'Alex', 'Moss'),
 (4401, 'Mary Ann', 'Wali')]

In [20]:
%%sql
--Display every patient's first_name. Order the list by the length of each name and then by alphbetically (MEDIUM)

SELECT first_name
FROM patients
ORDER BY LENGTH(first_name), first_name
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Al',),
 ('Al',),
 ('Al',),
 ('Al',),
 ('Al',),
 ('Al',),
 ('Al',),
 ('Bo',),
 ('Bo',),
 ('Bo',)]

In [21]:
%%sql
--Show the total amount of male patients and the total amount of female patients in the patients table. Display the two results in the same row. (MEDIUM)

SELECT
    (SELECT COUNT(*)
      FROM patients
      WHERE gender = 'M') AS M,
    (SELECT COUNT(*)
      FROM patients
      WHERE gender = 'F') AS F

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(2468, 2062)]

In [22]:
%%sql
--Show first and last name, allergies from patients which have allergies to either 'Penicillin' or 'Morphine'. Show results ordered ascending by allergies then by first_name then by last_name.

SELECT first_name, last_name, allergies
FROM patients
WHERE allergies = 'Penicillin' OR allergies = 'Morphine'
ORDER BY allergies ASC, first_name, last_name
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Briareos', 'Hayes', 'Morphine'),
 ('Christine', 'Argyros', 'Morphine'),
 ('Griselda', 'Hopper', 'Morphine'),
 ('Henry', 'Huang', 'Morphine'),
 ('Janice', 'Redfield', 'Morphine'),
 ('Jesse', 'Guarnaccia', 'Morphine'),
 ('Joel', 'Takata', 'Morphine'),
 ('Jon', 'Guarnaccia', 'Morphine'),
 ('Juan', 'Davies', 'Morphine'),
 ('Kelly', 'Landsman', 'Morphine')]

In [23]:
%%sql
--Show patient_id, diagnosis from admissions. Find patients admitted multiple times for the same diagnosis. (MEDIUM)

SELECT patient_id, diagnosis
FROM admissions
GROUP BY patient_id, diagnosis
HAVING COUNT(diagnosis) > 1

 * postgresql+psycopg2://postgres:***@localhost/hospital
11 rows affected.

[(4363, 'Congestive Heart Failure'),
 (2859, 'Severed Spine At C3'),
 (137, 'Pregnancy'),
 (2004, 'Left Shoulder Rotator Cuff Repair'),
 (4121, 'Congestive Heart Failure'),
 (3468, 'Congestive Heart Failure'),
 (3012, 'Appendicitis'),
 (320, 'Pneumonia'),
 (1577, 'Congestive Heart Failure'),
 (3367, 'Pyelonephritis'),
 (4083, 'Congestive Heart Failure')]

In [24]:
%%sql
--Show the city and the total number of patients in the city. Order from most to least patients and then by city name ascending. (MEDIUM)

SELECT city, COUNT(patient_id) AS num_of_patients
FROM patients
GROUP BY city
ORDER BY num_of_patients desc, city
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Hamilton', 1938),
 ('Toronto', 317),
 ('Burlington', 276),
 ('Brantford', 147),
 ('Ancaster', 117),
 ('Stoney Creek', 107),
 ('Cambridge', 79),
 ('Dundas', 79),
 ('Milton', 65),
 ('Paris', 58)]

In [25]:
%%sql
--Show first name, last name and role of every person that is either patient or doctor.
--The roles are either "Patient" or "Doctor" (MEDIUM)

SELECT
    first_name,
    last_name,
    'Patient' AS role
FROM patients
UNION ALL
SELECT
    first_name,
    last_name,
    'Doctor' AS role
FROM doctors
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Mickey', 'Baasha', 'Patient'),
 ('Jiji', 'Sharma', 'Patient'),
 ('Charles', 'Wolfe', 'Patient'),
 ('Sue', 'Falcon', 'Patient'),
 ('Sister', 'Spitzer', 'Patient'),
 ('Daphne', 'Seabright', 'Patient'),
 ('Rick', 'Bennett', 'Patient'),
 ('Woody', 'Bashir', 'Patient'),
 ('Tom', 'Halliwell', 'Patient'),
 ('Beanie', 'Foster', 'Patient')]

In [26]:
%%sql
--Show all allergies ordered by popularity. Remove NULL values from query. (MEDIUM)

SELECT allergies, COUNT(*) AS popularity
FROM patients
WHERE allergies IS NOT NULL
GROUP BY allergies
ORDER BY popularity DESC
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Penicillin', 1082),
 ('Codeine', 305),
 ('Sulfa', 157),
 ('ASA', 99),
 ('Sulfa Drugs', 71),
 ('Peanuts', 52),
 ('Iodine', 48),
 ('Tylenol', 42),
 ('Bee Stings', 40),
 ('Valporic Acid', 38)]

In [27]:
%%sql
--Show all patient's first_name, last_name, and birth_date who were born in the 1970s decade. Sort the list starting from the earliest birth_date. (MEDIUM)

SELECT first_name, last_name, birth_date
FROM patients
WHERE DATE_PART('year', birth_date)::INTEGER between 1970 AND 1979
ORDER BY birth_date
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Frances', 'Kobayakawa', datetime.date(1970, 1, 2)),
 ('Sunny', 'Burrell', datetime.date(1970, 1, 7)),
 ('Deborah', 'Stewart', datetime.date(1970, 1, 14)),
 ('Penelope', 'Beckett', datetime.date(1970, 1, 14)),
 ('Augusta', 'Decker', datetime.date(1970, 1, 22)),
 ('Sookie', 'Brearly', datetime.date(1970, 2, 1)),
 ('Temple', 'Wylie', datetime.date(1970, 2, 10)),
 ('Deanna', 'Spano', datetime.date(1970, 3, 23)),
 ('Jadu', 'Principal', datetime.date(1970, 3, 28)),
 ('Betty', 'Stephens', datetime.date(1970, 3, 28))]

In [28]:
%%sql
--We want to display each patient's full name in a single column. Their last_name in all upper letters must appear first, then first_name in all lower case letters. Separate the last_name and first_name with a comma. Order the list by the first_name in decending order (MEDIUM)

SELECT
    CONCAT(UPPER(last_name), ',', LOWER(first_name)) AS full_name
FROM patients
ORDER BY first_name DESC
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('MILLER,zoe',),
 ('CORBIE,ziva',),
 ('KOBAYAKAWA,zenigata',),
 ('OVERSTREET,zenigata',),
 ('BENNETT,zen',),
 ('MEPHESTO,zelda',),
 ('MORRIS,zelda',),
 ('THOMAS,zefram',),
 ('FLUTE,zefram',),
 ('MARONEY,zatanna',)]

In [29]:
%%sql
--Show the province_id(s), sum of height; where the total sum of its patient's height is greater than or equal to 7,000. (MEDIUM)

SELECT province_id, SUM(height) AS sum_height
FROM patients
GROUP BY province_id
HAVING sum(height) >= 7000

 * postgresql+psycopg2://postgres:***@localhost/hospital
3 rows affected.

[('NS', Decimal('9765')), ('BC', Decimal('7720')), ('ON', Decimal('678037'))]

In [30]:
%%sql
--Show the difference between the largest weight and smallest weight for patients with the last name 'Maroni' (MEDIUM)

SELECT MAX(weight) - MIN(weight) AS weight_diff
FROM patients
WHERE last_name = 'Maroni'

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(Decimal('71'),)]

In [31]:
%%sql
--Show all of the days of the month (1-31) and how many admission_dates occurred on that day. Sort by the day with most admissions to least admissions. (MEDIUM)

SELECT
    DATE_PART('day', admission_date)::INTEGER AS day_of_month,
    COUNT(*) AS num_of_admissions
FROM admissions
GROUP BY day_of_month
ORDER BY num_of_admissions DESC

 * postgresql+psycopg2://postgres:***@localhost/hospital
31 rows affected.

[(4, 184),
 (11, 184),
 (9, 183),
 (2, 180),
 (12, 179),
 (6, 179),
 (16, 177),
 (21, 174),
 (13, 173),
 (28, 173),
 (7, 167),
 (8, 166),
 (3, 166),
 (18, 166),
 (30, 165),
 (20, 165),
 (10, 164),
 (14, 164),
 (15, 164),
 (24, 161),
 (5, 161),
 (17, 160),
 (25, 159),
 (26, 157),
 (23, 156),
 (1, 156),
 (19, 152),
 (27, 149),
 (29, 140),
 (22, 140),
 (31, 103)]

In [32]:
%%sql
--Show all columns for patient_id 542's most recent admission_date. (MEDIUM)

SELECT *
FROM admissions
WHERE patient_id = 542
ORDER BY admission_date DESC
LIMIT 1

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(542, datetime.date(2019, 4, 6), datetime.date(2019, 4, 9), 'Abdominal Pain', 14)]

In [33]:
%%sql
--Show patient_id, attending_doctor_id, and diagnosis for admissions that match one of the two criteria:
--1. patient_id is an odd number and attending_doctor_id is either 1, 5, or 19.
--2. attending_doctor_id contains a 2 and the length of patient_id is 3 characters. (MEDIUM)

SELECT patient_id, attending_doctor_id, diagnosis
FROM admissions
WHERE
    patient_id % 2 = 1
    AND attending_doctor_id IN (1, 5, 19)
    OR attending_doctor_id::TEXT LIKE '%2%'
    AND LENGTH(patient_id::TEXT) = 3
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[(9, 19, 'Ruptured Appendicitis'),
 (13, 1, 'Renal Failure'),
 (15, 5, 'Hiatal Hernia'),
 (31, 19, 'Cardiovascular Disease'),
 (51, 1, 'Undiagnosed Chest Pain'),
 (100, 22, 'Depression, Dementia'),
 (100, 21, 'Respiratory Failure'),
 (103, 22, 'Ovarian Cyst'),
 (103, 2, 'Basal Skull Fracture'),
 (104, 25, 'Abdominal Pain')]

In [34]:
%%sql
--Show first_name, last_name, and the total number of admissions attended for each doctor. Every admission has been attended by a doctor. (MEDIUM)

SELECT first_name, last_name, num_of_admissions
FROM
    (SELECT attending_doctor_id, COUNT(*) AS num_of_admissions
     FROM admissions a
     JOIN doctors d
         ON a.attending_doctor_id = d.doctor_id
     GROUP BY attending_doctor_id) AS sourceTable
JOIN doctors
    ON sourceTable.attending_doctor_id = doctors.doctor_id

 * postgresql+psycopg2://postgres:***@localhost/hospital
27 rows affected.

[('Claude', 'Walls', 214),
 ('Joshua', 'Green', 187),
 ('Miriam', 'Tregre', 168),
 ('James', 'Russo', 197),
 ('Scott', 'Hill', 179),
 ('Tasha', 'Phillips', 168),
 ('Hazel', 'Patterson', 206),
 ('Mickey', 'Duval', 183),
 ('Jon', 'Nelson', 181),
 ('Monica', 'Singleton', 191),
 ('Douglas', 'Brooks', 201),
 ('Flora', 'Moore', 194),
 ('Angelica', 'Noe', 209),
 ('Tyrone', 'Smart', 182),
 ('Marie', 'Brinkman', 198),
 ('Irene', 'Brooks', 189),
 ('Mary', 'Walker', 191),
 ('Bobbi', 'Estrada', 176),
 ('Stephanie', 'Cohen', 182),
 ('Ralph', 'Wilson', 174),
 ('Lisa', 'Cuddy', 184),
 ('Simon', 'Santiago', 190),
 ('Heather', 'Beck', 178),
 ('Jenny', 'Pulaski', 162),
 ('Jeanette', 'Sites', 180),
 ('Larry', 'Miller', 200),
 ('Donna', 'Greenwood', 203)]

In [35]:
%%sql
--For each doctor, display their id, full name, and the first and last admission date they attended. (MEDIUM)

SELECT
    doctor_id,
    CONCAT(first_name, ' ', last_name) AS full_name,
    MIN(admission_date) AS first_admission,
    MAX(admission_date) AS last_admission
FROM admissions a
JOIN doctors d
    ON a.attending_doctor_id = d.doctor_id
GROUP BY doctor_id

 * postgresql+psycopg2://postgres:***@localhost/hospital
27 rows affected.

[(5, 'Scott Hill', datetime.date(2018, 6, 6), datetime.date(2019, 6, 5)),
 (18, 'Bobbi Estrada', datetime.date(2018, 6, 9), datetime.date(2019, 6, 1)),
 (2, 'Joshua Green', datetime.date(2018, 6, 6), datetime.date(2019, 6, 3)),
 (16, 'Irene Brooks', datetime.date(2018, 6, 8), datetime.date(2019, 6, 3)),
 (15, 'Marie Brinkman', datetime.date(2018, 6, 9), datetime.date(2019, 6, 1)),
 (6, 'Tasha Phillips', datetime.date(2018, 6, 6), datetime.date(2019, 6, 2)),
 (26, 'Larry Miller', datetime.date(2018, 6, 6), datetime.date(2019, 6, 5)),
 (12, 'Flora Moore', datetime.date(2018, 6, 7), datetime.date(2019, 6, 5)),
 (27, 'Donna Greenwood', datetime.date(2018, 6, 6), datetime.date(2019, 6, 5)),
 (23, 'Heather Beck', datetime.date(2018, 6, 6), datetime.date(2019, 6, 4)),
 (11, 'Douglas Brooks', datetime.date(2018, 6, 10), datetime.date(2019, 5, 31)),
 (8, 'Mickey Duval', datetime.date(2018, 6, 10), datetime.date(2019, 6, 5)),
 (24, 'Jenny Pulaski', datetime.date(2018, 6, 6), datetime.date(2019, 6, 5)),
 (19, 'Stephanie Cohen', datetime.date(2018, 6, 6), datetime.date(2019, 6, 5)),
 (25, 'Jeanette Sites', datetime.date(2018, 6, 7), datetime.date(2019, 6, 5)),
 (4, 'James Russo', datetime.date(2018, 6, 10), datetime.date(2019, 6, 4)),
 (21, 'Lisa Cuddy', datetime.date(2018, 6, 6), datetime.date(2019, 6, 5)),
 (14, 'Tyrone Smart', datetime.date(2018, 6, 6), datetime.date(2019, 5, 31)),
 (3, 'Miriam Tregre', datetime.date(2018, 6, 6), datetime.date(2019, 6, 3)),
 (17, 'Mary Walker', datetime.date(2018, 6, 8), datetime.date(2019, 6, 5)),
 (20, 'Ralph Wilson', datetime.date(2018, 6, 6), datetime.date(2019, 6, 1)),
 (22, 'Simon Santiago', datetime.date(2018, 6, 8), datetime.date(2019, 6, 4)),
 (7, 'Hazel Patterson', datetime.date(2018, 6, 10), datetime.date(2019, 6, 5)),
 (13, 'Angelica Noe', datetime.date(2018, 6, 7), datetime.date(2019, 6, 4)),
 (10, 'Monica Singleton', datetime.date(2018, 6, 9), datetime.date(2019, 6, 4)),
 (9, 'Jon Nelson', datetime.date(2018, 6, 10), datetime.date(2019, 6, 5)),
 (1, 'Claude Walls', datetime.date(2018, 6, 10), datetime.date(2019, 6, 3))]

In [36]:
%%sql
--Display the total amount of patients for each province. Order by descending. (MEDIUM)

SELECT province_name, COUNT(*) AS num_of_patients
FROM patients p
JOIN province_names pn
	ON p.province_id = pn.province_id
GROUP BY province_name
ORDER BY num_of_patients DESC

 * postgresql+psycopg2://postgres:***@localhost/hospital
8 rows affected.

[('Ontario', 4298),
 ('Nova Scotia', 60),
 ('British Columbia', 49),
 ('Alberta', 47),
 ('Manitoba', 31),
 ('Quebec', 23),
 ('Saskatchewan', 13),
 ('Newfoundland and Labrador', 9)]

In [37]:
%%sql
--For every admission, display the patient's full name, their admission diagnosis, and their doctor's full name who diagnosed their problem. (MEDIUM)

SELECT 
    CONCAT(p.first_name, ' ', p.last_name) AS patient_full_name,
    diagnosis,
    CONCAT(d.first_name, ' ', d.last_name) AS doctor_full_name
FROM admissions a
JOIN patients p
    ON a.patient_id = p.patient_id
JOIN doctors d
    ON a.attending_doctor_id = d.doctor_id
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Donald Waterfield', 'Ovarian Dermoid-Cyct', 'Lisa Cuddy'),
 ('Donald Waterfield', 'Ineffective Breathin Pattern R/T Fluid Accumulatio', 'Jenny Pulaski'),
 ('Jiji Sharma', 'Cardiac Arrest', 'Joshua Green'),
 ('Jiji Sharma', 'Congestive Heart Failure', 'Mickey Duval'),
 ('Sue Falcon', 'Asthma Exacerbation', 'Miriam Tregre'),
 ('Sue Falcon', 'Uterine Fibroid', 'Simon Santiago'),
 ('Thomas ONeill', 'Cancer', 'Mickey Duval'),
 ('Sonny Beckett', 'Amigima', 'Tasha Phillips'),
 ('Sister Spitzer', 'Osteoarthritis', 'Mickey Duval'),
 ('Sister Spitzer', 'Ruptured Appendicitis', 'Stephanie Cohen')]

In [38]:
%%sql
--display the number of duplicate patients based on their first_name and last_name. (MEDIUM)

SELECT first_name, last_name, COUNT(*) AS num_of_duplicate
FROM patients
GROUP BY first_name, last_name
HAVING COUNT(*) > 1

 * postgresql+psycopg2://postgres:***@localhost/hospital
19 rows affected.

[('Belladonna', 'Thomas', 2),
 ('Sam', 'Carr', 2),
 ('Dol', 'Forelli', 2),
 ('Sam', 'Jackson', 2),
 ('Alexandra', 'Holroyd', 2),
 ('Mendy', 'Farrell', 2),
 ('Luanne', 'Matthews', 2),
 ('Chris', 'Johnson', 2),
 ('Marcus', 'Jackson', 2),
 ('Avon', 'Travis', 2),
 ('Jackson', 'Kennedy', 2),
 ('Jack', 'McArthur', 2),
 ('Jack', 'Valentine', 2),
 ('Jack', 'Bennett', 2),
 ('Sam', 'Moss', 2),
 ('Samantha', 'Blossom', 2),
 ('Emil', 'Owens', 2),
 ('Jim', 'Grant', 2),
 ('Kay', 'Sanderson', 2)]

In [39]:
%%sql
--Display patient's full name, height in the units feet rounded to 1 decimal, weight in the unit pounds rounded to 0 decimals, birth_date, gender non abbreviated.
--Convert CM to feet by dividing by 30.48. Convert KG to pounds by multiplying by 2.205. (MEDIUM)

SELECT 
    CONCAT(first_name, ' ', last_name) AS full_name,
    ROUND(height / 30.48, 1) AS height_feet,
    ROUND(weight * 2.205, 0) AS weight_pounds,
    birth_date,
    CASE
        WHEN gender = 'M' THEN 'MALE'
        ELSE 'FEMALE'
        END AS gender
FROM patients
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Mickey Baasha', Decimal('6.1'), Decimal('168'), datetime.date(1981, 5, 28), 'MALE'),
 ('Jiji Sharma', Decimal('6.4'), Decimal('234'), datetime.date(1957, 9, 5), 'MALE'),
 ('Charles Wolfe', Decimal('1.5'), Decimal('22'), datetime.date(2017, 11, 19), 'MALE'),
 ('Sue Falcon', Decimal('1.4'), Decimal('11'), datetime.date(2017, 9, 30), 'FEMALE'),
 ('Sister Spitzer', Decimal('5.7'), Decimal('209'), datetime.date(1966, 10, 15), 'FEMALE'),
 ('Daphne Seabright', Decimal('4.8'), Decimal('170'), datetime.date(1954, 11, 18), 'FEMALE'),
 ('Rick Bennett', Decimal('7.2'), Decimal('209'), datetime.date(1977, 1, 27), 'MALE'),
 ('Woody Bashir', Decimal('5.0'), Decimal('130'), datetime.date(1951, 11, 15), 'MALE'),
 ('Tom Halliwell', Decimal('5.9'), Decimal('251'), datetime.date(1987, 8, 1), 'MALE'),
 ('Beanie Foster', Decimal('5.1'), Decimal('165'), datetime.date(1998, 11, 22), 'FEMALE')]

In [40]:
%%sql
--Show patient_id, first_name, last_name from patients whose does not have any records in the admissions table. (Their patient_id does not exist in any admissions.patient_id rows.) (MEDIUM)

SELECT p.patient_id, first_name, last_name
FROM patients p
LEFT JOIN admissions a
    ON p.patient_id = a.patient_id
WHERE a.patient_id IS NULL
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[(2, 'Mickey', 'Baasha'),
 (5, 'Charles', 'Wolfe'),
 (14, 'Rick', 'Bennett'),
 (25, 'John', 'Farley'),
 (42, 'Alice', 'Donovan'),
 (43, 'Stone', 'Cutting'),
 (44, 'Neil', 'Allan'),
 (57, 'Woody', 'Riviera'),
 (65, 'Haiku', 'Alpert'),
 (72, 'Lily', 'Vargas')]

In [41]:
%%sql
--Show first name, last name, and gender of patients whose gender is 'M' (EASY)

SELECT first_name, last_name, gender
FROM patients
WHERE gender = 'M'
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Mickey', 'Baasha', 'M'),
 ('Jiji', 'Sharma', 'M'),
 ('Charles', 'Wolfe', 'M'),
 ('Rick', 'Bennett', 'M'),
 ('Woody', 'Bashir', 'M'),
 ('Tom', 'Halliwell', 'M'),
 ('Nino', 'Andrews', 'M'),
 ('John', 'Farley', 'M'),
 ('Jim', 'Thomas', 'M'),
 ('Sam', 'Threep', 'M')]

In [42]:
%%sql
--Show first name and last name of patients who does not have allergies. (null) (EASY)

SELECT first_name, last_name
FROM patients
WHERE allergies IS NULL
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Anne', 'Marlowe'),
 ('Temple', 'Scott'),
 ('Shaz', 'Maud'),
 ('Bo', 'Perry'),
 ('Charles', 'Andonuts'),
 ('Shaz', 'Manu'),
 ('Dorrie', 'Brennan'),
 ('Karen', 'Skeeter'),
 ('Ella', 'Lupo'),
 ('Mickey', 'Ross')]

In [43]:
%%sql
--Show first name of patients that start with the letter 'C' (EASY)

SELECT first_name
FROM patients
WHERE first_name LIKE 'C%'
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Charles',),
 ('Calleigh',),
 ('Catherine',),
 ('Casanova',),
 ('Cary',),
 ('Christine',),
 ('Carol',),
 ('Corrado',),
 ('Claudia',),
 ('Celestina',)]

In [44]:
%%sql
--Show first name and last name of patients that weight within the range of 100 to 120 (inclusive) (EASY)

SELECT first_name, last_name
FROM patients
WHERE weight >= 100 AND weight <= 120
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Jiji', 'Sharma'),
 ('Tom', 'Halliwell'),
 ('John', 'Farley'),
 ('Temple', 'Russert'),
 ('Phil', 'Chester'),
 ('Woody', 'Riviera'),
 ('Shiro', 'Whale'),
 ('Catherine', 'Minoru'),
 ('Danny', 'Hardbroom'),
 ('Lily', 'Vargas')]

In [45]:
%%sql
--Update the patients table for the allergies column. If the patient's allergies is null then replace it with 'NKA' (EASY)

UPDATE patients
SET allergies = 'NKA'
WHERE allergies IS NULL

 * postgresql+psycopg2://postgres:***@localhost/hospital
2059 rows affected.

[]

In [46]:
%%sql
--Show first name and last name concatinated into one column to show their full name. (EASY)

SELECT concat(first_name, ' ', last_name) AS full_name
FROM patients
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Mickey Baasha',),
 ('Jiji Sharma',),
 ('Charles Wolfe',),
 ('Sue Falcon',),
 ('Sister Spitzer',),
 ('Daphne Seabright',),
 ('Rick Bennett',),
 ('Woody Bashir',),
 ('Tom Halliwell',),
 ('Beanie Foster',)]

In [47]:
%%sql
--Show first name, last name, and the full province name of each patient.
--Example: 'Ontario' instead of 'ON' (EASY)

SELECT first_name, last_name, province_name
FROM patients p
JOIN province_names pn
    ON p.province_id = pn.province_id
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Mickey', 'Baasha', 'Ontario'),
 ('Jiji', 'Sharma', 'Ontario'),
 ('Charles', 'Wolfe', 'Ontario'),
 ('Sue', 'Falcon', 'Ontario'),
 ('Sister', 'Spitzer', 'Ontario'),
 ('Daphne', 'Seabright', 'Ontario'),
 ('Rick', 'Bennett', 'Ontario'),
 ('Woody', 'Bashir', 'Ontario'),
 ('Tom', 'Halliwell', 'Ontario'),
 ('Beanie', 'Foster', 'Ontario')]

In [48]:
%%sql
--Show how many patients have a birth_date with 2010 as the birth year. (EASY)

SELECT COUNT(*) AS total_patients_2010
FROM patients
WHERE DATE_PART('year', birth_date) = 2010

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(55,)]

In [49]:
%%sql
--Show the first_name, last_name, and height of the patient with the greatest height. (EASY)

SELECT first_name, last_name, height
FROM patients
WHERE height = (SELECT MAX(height) FROM patients)

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[('Sam', 'Haruko', Decimal('226'))]

In [50]:
%%sql
-- Show all columns for patients who have one of the following patient_ids:
-- 1,45,534,879,1000 (EASY)

SELECT *
FROM patients
WHERE patient_id IN (1, 45, 534, 879, 1000)

 * postgresql+psycopg2://postgres:***@localhost/hospital
5 rows affected.

[(879, 'Orla', 'Shawn', 'F', datetime.date(1967, 9, 24), 'Sarnia', 'ON', 'Penicillin', Decimal('149'), Decimal('65')),
 (1000, 'Rick', 'Williams', 'M', datetime.date(1975, 4, 13), 'Hamilton', 'ON', 'Penicillin', Decimal('176'), Decimal('127')),
 (534, 'Don', 'Zatara', 'M', datetime.date(2008, 1, 11), 'Timmins', 'ON', None, Decimal('136'), Decimal('67')),
 (1, 'Donald', 'Waterfield', 'M', datetime.date(1963, 2, 12), 'Barrie', 'ON', None, Decimal('156'), Decimal('65')),
 (45, 'Cross', 'Gordon', 'M', datetime.date(2009, 3, 20), 'Ancaster', 'ON', None, Decimal('125'), Decimal('53'))]

In [51]:
%%sql
-- Show the total number of admissions (EASY)

SELECT COUNT(*)
FROM admissions

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(5067,)]

In [52]:
%%sql
-- Show all the columns from admissions where the patient was admitted and discharged on the same day. (EASY)

SELECT *
FROM admissions
WHERE admission_date = discharge_date
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[(1, datetime.date(2018, 9, 20), datetime.date(2018, 9, 20), 'Ineffective Breathin Pattern R/T Fluid Accumulatio', 24),
 (9, datetime.date(2018, 12, 31), datetime.date(2018, 12, 31), 'Ruptured Appendicitis', 19),
 (10, datetime.date(2019, 2, 27), datetime.date(2019, 2, 27), 'Lower Quadrant Pain', 27),
 (17, datetime.date(2019, 3, 4), datetime.date(2019, 3, 4), 'Diabetes Mellitus', 9),
 (28, datetime.date(2019, 3, 30), datetime.date(2019, 3, 30), 'Cancer Of The Stomach', 26),
 (31, datetime.date(2018, 9, 26), datetime.date(2018, 9, 26), 'Cardiovascular Disease', 19),
 (53, datetime.date(2018, 10, 24), datetime.date(2018, 10, 24), 'Urinary Tract Infection', 8),
 (54, datetime.date(2019, 4, 7), datetime.date(2019, 4, 7), 'Hypertension', 21),
 (70, datetime.date(2018, 7, 17), datetime.date(2018, 7, 17), 'Migraine', 20),
 (78, datetime.date(2018, 6, 17), datetime.date(2018, 6, 17), 'Hypertension', 17)]

In [53]:
%%sql
-- Show the patient id and the total number of admissions for patient_id 579. (EASY)

SELECT patient_id, COUNT(*) AS total_admissions
FROM admissions
WHERE patient_id = 579
GROUP BY patient_id

 * postgresql+psycopg2://postgres:***@localhost/hospital
1 rows affected.

[(579, 2)]

In [54]:
%%sql
--Based on the cities that our patients live in, show unique cities that are in province_id 'NS' (EASY)

SELECT DISTINCT(city) AS unique_cities
FROM patients
WHERE province_id = 'NS'

 * postgresql+psycopg2://postgres:***@localhost/hospital
3 rows affected.

[('Halifax',), ('Inverness',), ('Port Hawkesbury',)]

In [55]:
%%sql
--Write a query to find the first_name, last name and birth date of patients who has height greater than 160 and weight greater than 70 (EASY)

SELECT first_name, last_name, birth_date
FROM patients
WHERE height > 160 AND weight > 70
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Mickey', 'Baasha', datetime.date(1981, 5, 28)),
 ('Jiji', 'Sharma', datetime.date(1957, 9, 5)),
 ('Sister', 'Spitzer', datetime.date(1966, 10, 15)),
 ('Rick', 'Bennett', datetime.date(1977, 1, 27)),
 ('Tom', 'Halliwell', datetime.date(1987, 8, 1)),
 ('Nino', 'Andrews', datetime.date(2001, 4, 21)),
 ('John', 'Farley', datetime.date(1956, 9, 12)),
 ('Sam', 'Threep', datetime.date(1982, 6, 16)),
 ('Roland', 'Edge', datetime.date(1967, 9, 25)),
 ('Temple', 'Russert', datetime.date(1953, 5, 11))]

In [56]:
%%sql
--Write a query to find list of patients first_name, last_name, and allergies from Hamilton where allergies are not null (EASY)

SELECT first_name, last_name, allergies
FROM patients
WHERE city = 'Hamilton' AND allergies IS NOT NULL
--LIMIT 10

 * postgresql+psycopg2://postgres:***@localhost/hospital
10 rows affected.

[('Jiji', 'Sharma', 'Penicillin'),
 ('Tom', 'Halliwell', 'Ragweed'),
 ('Nino', 'Andrews', 'Peanuts'),
 ('John', 'Farley', 'Gluten'),
 ('Sam', 'Threep', 'Sulpha'),
 ('Temple', 'Russert', 'Hay Fever'),
 ('Alice', 'Donovan', 'Penicillin'),
 ('Stone', 'Cutting', 'Codeine'),
 ('Phil', 'Chester', 'Penicillin'),
 ('Roland', 'Murphy', 'Sulfa Drugs')]